#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-stable/runs/run-zPHBxCttwTgcis3s

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-stable]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_stable]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_stable]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=stable_internal]
aws_iam_user.schutzbot_webhook_sqs: Refreshing state... [id=schutzbot_webhook_stable]
aws_sqs_queue.schutzbot_webhook_sqs: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/schutzbot_webhook_sqs-stable]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.stable]
aws_iam_user.packer: Refreshing state... [id=packer_stable]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=stable_external]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_stable]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_stable]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_stable]
aws_cloudwatch_log_stream.internal_worker_syslog: Refreshing state... [id=worker_syslog]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_stable]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_stable]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_stable]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_stable]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_stable]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_stable]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_stable]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=composer_syslog]
aws_cloudwatch_log_stream.external_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_stable]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_stable]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_stable]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-02523067c19e4d4ba]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-07a88a5868e40dd45]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-06923f1c47108b9a0]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_stable]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_stable]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_stable]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_stable]
aws_iam_policy.schutzbot_webhook_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/schutzbot_webhook_sqs_stable]
aws_sqs_queue_policy.test: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/schutzbot_webhook_sqs-stable]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_stable]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_stable]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_stable-20210121192700353500000003]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_stable-20201204205417226300000005]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_stable]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_stable-20210121192700349000000001]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_stable]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_stable-20210121192700351400000002]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_stable]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_stable-20201204205417237900000006]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_stable-20201204205416966800000003]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-08911eae9abd84cf6]
aws_security_group.external_workers: Refreshing state... [id=sg-0101286a377e77349]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_stable-20210128142934236300000001]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_stable-20210128142934423800000002]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_stable]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0ca491f03889e64a6]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0504fafb159143d31]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_stable-20210128142934521000000006]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_stable-20210128142934485800000004]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_stable-20210128142934539400000007]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_stable-20210128142934516900000005]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_stable-20210128142934468200000003]
aws_iam_user_policy_attachment.schutzbot_webhook_sqs: Refreshing state... [id=schutzbot_webhook_stable-20210210153920969700000001]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_stable]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_stable-20210121142052939600000001]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_stable-20201204205417404800000008]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_stable-20210121142052962300000002]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=1bf38e95-9b24-4495-a732-2ead00868a91]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_stable-20201204205417038600000004]
aws_security_group.external_composer: Refreshing state... [id=sg-006abcb539c009c0c]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_stable-2020120420541781800000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_stable-2020120420541783040000000b]
aws_network_interface.composer_internal: Refreshing state... [id=eni-0df7102235a986cee]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-0789bee2463abeaba]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_stable]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_stable-20210121142053396000000003]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_stable-20210121142053428000000004]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-04cdca8908908504f]
aws_network_interface.composer_external: Refreshing state... [id=eni-0f0890d7291842f4e]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_stable-20201204205417690700000009]
aws_eip.lb: Refreshing state... [id=eipalloc-0db925336463825a2]
aws_instance.composer_external: Refreshing state... [id=i-08d997480fcea25b8]
aws_instance.composer_internal: Refreshing state... [id=i-0487676f48bf9a178]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-2721302523]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0a0bd62efe297d67e]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-3888549415]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-08f0a8a5c9c6547df]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-8bae3ad7-cdff-463d-988e-2523e1a556c0]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-f1d45ae7-9d42-4683-a561-7154abfcdfb7]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "657828995" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4aY/juLX2dwPzH/R6GngT9JWtxXaVK1ODWLbkVbJFidpyA0MLbcmilpIobz393y/kpVJdXT1JkAtcTH1xkTwbHz6H51DDLCUoJbR+ytETlVSYRLlbkHYSHVHwF8rLqjRwi9NzU57KorCEymgA7GajHtEGKsooS58otsX81PipQdNvhX5q3G2PojLPyohcZF1CXD9MUEr+Qm0ijFI3Qc/NKI1Iy99sm//Q0gs3LTeooMXUz4Io3T5RD15E3ghcQiboSNo+zqqA9rN0E21/ashRgr4L7ue3Mo1GVaKifGpQFE3VETxRyOfoerJBURRVluHarUiYFdEZBesYnS6y9R9NNcsypIvSpQaDwUDglbM7ZE8+J9bD0UAdCIPBYDhQh8fdRppO8XgzTPuRjyenxCxEodAhhxc9EmtjnUX5QzBcnQ/szu6ZaajilSXnaFVEylGx8PjRN5f9NpByIWDOfemgnD7Hm23Y31Qnxe70p59lt7c86Yaw7YZKJh03wBp3ownx25qKU0+UonmuxR0c5VlHdYhAku3gZRtrg97oHJ62Xq/qyv3oqE+PHVPYVZrMjC31rOxytDlFZvW5nILPIQcLNZ4PhKqa2qpX7PBnKTQSd7Ev9id9yVXlkuxTW9iF3upwWj5w5mrn5vOg3Q9192Ulsgfp1IMSl1p+Z7U9MNtI9Xpl5En6+UHR0dHku2r/8SVXl6Zsz/186xRYcyeTuaPJITkvH+TAKZYLCVqZxg7Q4NTZhsRXiqWgY6+r7VcP/PnMvAhA4vzhsrNkDnn3cHhZhfsDlxKPz/XFigSIzD4bXUZdpXlqnTQtdXLuLB18xLGedew9pGEfp+GicLY79OBnaroaSMe2j/meqM1O26ha+cLhc8w+2hW2ZQu+uAKJD7NFDHajfKdbHOrKM7aXjR7K2cTvtM1ufNos9oFcGmHwwg6tydgwlvk523pMv2vYEQMsKU8d0GaRsR22wWfTOBF7Yz8yxcZY+sEg48bOJp11zzaA1mzWl53YTY9HXnyAyygWZ0q/hDuOYc694enETDfTF92bsUJ387AJeNcHxaIz8m0YSNM2K5wUsyexuwffiQbj5WyueGdLYnSebB6PDGLV52cqcXdZ8dcCBaFLWn6WNL/lOwq4bpftXzg/vHIeO6Mpq+hit56brgR2J+FO3pN0ITpO9N5hGfesx3TXdh5QtlJUsS0zh3nnsTunMq8K3OgbZ41DERG0rm+EW1rmLgmfqDZJ8mt6r+s7Yr13i/ISmX+9BZ6o326BLjUBThej9XApy1P9+ZH33c0jw6Au1+U6XoftbB42XW/TdRET8H6f5fzHPtvnbtrDpbxaaiK4qz9suojvBUG/88h2mY3rdzyG7/E9vxfwfc976CEOPbLB5r3zwXooAv15oTFkobFDAIOZHgkjYMygBp2ZykgQXNYYMozZmQaBaIjKSDUdy2EkXoMzwWGwAUeKKnP2WTGEMYy7rMc5DErkrj6KOTAOoccBIWAAMGG+8Nh85k6cnR5LAMDDXMWSEDDOCzAMRY3xRNUlA0CJD5hjJDPd3JGC0mfzkWI5O89UeG0c7vSYfVGtYGWIRk83gIMgKxq6YrljZalbuRAc8nqt881aLFm6MQMBY6QmBCY0JBGIEhMk8knbSaHBh4U+ZrrIyHsqowiQwTyQJEeLyd6McRYkynJ4iXk2hFASHS6QoCiJF1mzP6rHaiwpaioUpiHZmqHI9jlcmGauQAOnKBXAEiqCzM4WchJMwUg42pZ0DnbbuW3MdkYscwqWu04cHgGERxceDVN85OXRDKCdcXa5PJP5/KhP8ATuQh5ie7/glJlsTo/+TjCQkes2c3Rl1ucNIz+ph4xRRiCx+eysW7jjSUrPYA0HskKqxnjhjgNhOZGIj3NNNvuJbYITmhiaPiRnL3ZEzSQdmfcL+yzNHcOo5EQpZSnIh9hgzNFsAlhnBHCg6Jy0d2JQmJIxAqmx0CbBHJrBWJ+AsyYqrmkqSYADU5NyV4k7nYAJDjKWXFOfdu1zyHqW8CIbgzkUndIU5Y4zllxdZENTwhHQBUWzgCmLylRLBR4w+GCnuPIMDL0hOYPU4LwR2Btj9oQm2R5ZYc8XAWfE7MqPpZmn5h2PK3kfG8SYGDEYGxJkZ0OdCwQZEtaGrGZMjFCzBOCdZ7HHO8f5eXAEiX1WYedkQEUIGENQTWlpiOwYWMEUGlgcYkeTxf5QxVgCccY7umPLfHxwxv3S1/pzGzu5HeM84EAF2UGhxOxwKQaCbBixZgXAhOzQhtJY2wVYwdsz0oXY4w7zH+gKd11gBZIa9XkIHUWF7FA17c7HeXV85ai6zQWQ5pzCYawxfteT8oUfT0+6ybquKB01EcvIPIY6j01f93lwxkPdmEGQKgczhYw8mfKABbzNgCxItiyAyl6TpGiYHItAF2wF9m2HAZw5UYb+uD/WJjNOFslKM4+6whpz2bIPyrjcaxin5sQvvHEOjYm8X1r5wduFmpEciT+Be8CwK12Hc2jOJnBIlu7OcP2zkQDGsVyxw+v6lIUmMZaj2dybhFiLpRJa4VTljiM4NjowVhRbl7qKNeCNcTddjoSFhgMGGYK6VHMGcoGipgNeMQzNMR8ZBcIOFPOTlg7O7gTvFWnWWRozADhyQqaiaVaQqHHIuXyoaIlT+ZzMm1qfU0zMgl1IkMj2hjuFseOsO2fyLoASq02yox0HrA8Ve85Lc2gAGAz7wDvbpyAOLBvGXcg6CxvLHdsIZfU8WyqptHPN2dHfwY6zA6IWq3MtVUpde+T9idL1d9JesQBjx7NKwTGrWnJ/GF3vZAC74lRUJIjBDMR4pBpAut7lzPx9pZgsNf0ZHQkqUhfXVSzPSlS0stKrIhy0smL7XmMwGgFR057ZB67Fs61ep8UyNxlzCeYiWGvaYj0XbW09AMqzW6RP7qF8KpFfIFImbupuUfFUlTRyS0KzT32ef+hybP+h3+/fpJ5KVOwjH116VnrKjXkzu7nQoKANwXSlT5fKWh4og/Gt3A2U0X/gr/JKv4jyurunbyq0nyWJmwZ0rNo469/925ouyhfYlIEsrldAlKbWc0lcDyP6DiR9yIr41oa/gW40Bc9tRPz2DV76jvfduDgEoq697ktURqvlVNHXECyeQ0Ly8qnd/nZjrdeNtdzEPWepeyjrY2y/bT8+cvndRItkCf64K/lbnO2iv98GLsbZAQXrIEvcKC2pZ+pvVJMgN3lLmuZ/Uc2w8lpegQ7v56/YfL9E3T34LvVMNT+O2ndpvyCtHNXt1i26q8F/O77/tTjeIb1HPsmK28/voVpmVeGjsrXLqpo0wd0vOeWo9nyfv3ex6OjjKkDrKo3IZV/Nm49bujT//gpJGaVx2coq8t6meyjXl0704BI/XONsW97NR2lekRter65fwUBpkGdRSmojdyrW2j8k4N3stsiqfF2/T2vVa6Ks74lyFypJgdzkVep6NOvyVOJs+7r92xO65WcB8i8AlVnabDSKKvWT4Npwl6eSoMQnmEJp7Ymi6TQ7UFegfud5/+881I90GSKMrzfGj17q/6/tRWnbc8uwUSJC0ajKqDzK0caNcON68h+/Cxo/U2NEKBIiKkpL4qY+oqajVmOqaPpAGYrr6ej505/8qsAUvSip+iye2m22129x3U7r9tvGLkElaSeIuHTgErd9t0VHwZ9rH4OyREkNUJiVpMa91ZDgYvF6sz03P335+LL7Sn/68iaYr83a3KqouZFV18BTdHhjF/lhRjU1REiUbm8n9LpMkYz69OUb119bF5PaDYV3Cq3G/b/6lEtE6FdTn74x88c47Rs41wLk1QC9njrJKDBRrmAAtI1KgopveXGISHiRabSrsmjjzHfxJRL3UFLfFgpqiwh9naL3Lq4Q9d91wtD3vKZrQn368nsl6OtN5WYlCmr5f1KPv1K/UbsXii6oZku76GmkiNJtk/r1Csjb0ru+xbq+ld5WneCNu/rvSTb/RWPUb9TlkIqEojf/agCNj9qD2zdAiqbdimR/JK6NUI6zE1X3VtQmK6jrZVteeXZbrFl2r3XUcED5qCDRJvJdgloNzy1Rr0PRAUVTv/zyC/Xpy7svB1+pX6lPX962PV/fFMwfuYnRiXLT4Ftf/1e8/qCV/adUvlWtGthvmfuPhebHkldavoL6PXpXBTpGpwuC7wz7BfkPDd+P5k1efLebPx7FL+1YXR0+IHpdXar8jUjjZ0pfjpZ/SkL3FKD0z0+UWRcyFNT3sJ+le1TU9Sgq6/FI0ai6xBbUIUQpdUAUdqvUD1sN3yWXpGi+Qfr2ZPr6Fv26Sn1tUr/++jaEPxDE93Je5TdcqVsXesN3VaDcLRD1vnP+/yVVoCQj6L3aJffLzI8RKVuNH/Rxd2tXE7dn1l/fw/r0+MAw34FJ0z81/icAAP//OpHtlioaAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=external.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.10
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=stable-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://logs.us-east-1.amazonaws.com/"
                      group_name = "stable_external"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - systemctl enable --now vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
                echo "Setting up worker services."
                
                # Prepare osbuild-composer's remote worker services and sockets.
                systemctl enable --now osbuild-remote-worker@${COMPOSER_HOST}:8700
              + 
              + # Now that everything is configured, ensure monit is monitoring everything.
              + systemctl enable --now monit
            EOT
            # (1 unchanged attribute hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "1993406471" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R4aZOjypX2d0Xc/8Ard8RrRw8Si5ZS2XXDQgKtIJGQIPA4FAmkBCJZClJr3/7vE2gpV1f3vbZnJmLi1hcVmec85/Dkk3lOMshSilPKmuccPzPJntAoRwVtJtEJB39mvGyfBqg4v9TViSpLC6gN+8Cp16on1sJFGWXpM8M3uJ9qP9VY9r3RT7UH9jAq86yM6NUWUYr8MMEp/TOziQhOUYJf6lEa0Ya/2db/4WUWKC03uGDl1M+CKN0+M10vou8MrilTfKJNn2T7gPWzdBNtf6qpUYK/S+4P721qtX2Ji/K5xjAsU2XwzGBfYKvBGsMwTFmGa7SnYVZEFxysY3y+2lZ/LFMvy5AtSsT0+/2+JGoXNODPviBXj8O+3pf6/f6grw9Ou40ymZDRZpD2Ip+Mz4ldyFJhQoHMOzQ2RiaP824wWF6O/M7p2Gmok+VKzfGyiLSTtiKjJ99e9JpAyaWAu/SUo3b+HG+2YW+zP2tOqzf5rKLO4mxa0rYdaply2oDVqB2Nqd80dJJ6shLNciNukSjPWrpLJZps+6/b2Oh3hpfwvPU6+7bai07m5NSypd3eULnRSr9ouxxvzpG9/1xOwOdQgIUez/rSfj9xdK/Ykc9KaCVofigOZ3Mh7MsFPaSOtAu95fG86Ar2cofyWdDshSZ6Xcr8UTl3oCKkK7+13B65baR7nTLyFPPS1Ux8ssW23nt6zfWFrTozP9+6BTHQeDxzDTWkl0VXDdxiMVfgKjP4Pu6fW9uQ+lqxkEzitY3DsiteLtyrBBTBHyxaC+6Yt4/H12V4OAop9cTcnC9pgOn0s9Xm9GWap6uzYaRuLlyUo48F3ludOt007JE0nBfudoe7fqany75yavpE7MjG9LyN9ktfOn6O+SdnTxx1BV+RROPjdB6D3TDfmSsBt9Up38mG3XI69ltNux2fN/NDoJZWGLzyg9V4ZFmL/JJtPa7XtpyIAyslT13Q5LG1HTTBZ9s6U2fjPHHFxlr4QT8TRu4mnbYvDoCr6bSnujFKTydR7sJFFMtTrVfCncBxl87gfOYmm8mr6U15qb3pbgIR+aCYt4a+AwNl0uSls2Z3FH7X9d2oP1pMZ5p3WSmcKdLN04nDvP7ywiRolxV/LXAQItrws6T+rd5xILTbfO+q+cFN88QdTnjNlNvV2GQp8TuFtPKOYkrRaWx2jou4s3pKd023i7OlpstNlTvOWk/tGZN5+wBF3wSrHYuI4nV1Ity3ZY5o+Mw0aZLftve6OiPWB1SU18z82ynwzPxyT3RhSHAyH64HC1WdmC9Poo82TxyH20JbaHktvrXpbtrepo0wF4h+jxf8px7fE+7eg4W6XBgyeLh3N20sdoKg13ri29wG+S2PEztix+8EYs/zuh0s4Cc+2HwM3l8PZGC+zA2Ozg1+AGAwNSNpCKwpNKA71TkFguscRwcxPzUgkC1ZG+q2u3I5RTTgVHI5YsGhpquCc9EsaQTjNu8JLocTtW0OYwGMQugJQAo4AGyYzz0+n6KxuzNjBQB4nOlEkQLOfQWWpekxGeumYgGoiAF3ilSunbtKUPp8PtRW7s6zNdEYhTsz5l/1VbC0ZKtjWsDFkJctU1uhkbYwV7kUHPNqrvXNXKysTGsKAs5KbQhsaCkykBUuSNSzsVNCSwwLc8S1sZV3dE6TIEdEoCiuEdODHZMsSLTF4JrzdAChIrtCoEBZka+2dm9YPeuxoumpVNiW4hiWpjqXcG7buQYtkuJUAguoSSo/natJMAFD6eSslEuw284ca7qzYlXQiNp24/AEIDwheLJs+UlUh1OAd9YFCXmmivnJHJMx3IUiJM5hLmhT1Z6c/J1kYSs3He6EVN4XLSs/68eM04YgccTsYq5Iy1O0jsVbLuSlVI/JHI0CaTFWqE9yQ7V7iWODMx5bhjmgFy92ZcOmLVX0C+eizFzL2quJVqpKkA+IxdnD6Rjw7hCQQDMF5eDGoLAVawhSa26Mgxm0g5E5BhdD1pBta0lAAttQcqTFrVbABUeVKMg2J23nEvLeSnpVrf4Mym5py2rLHSnIlPnQVkgETEkzVsBWZW1ipJIIOHJ0UrL3LAK9Ab2A1BK8IThYI/6Mx9kBr8KOLwPBivmlHytTT89bnlCKPrGoNbZiMLIUyE8HphBIKqS8A3nDGluhsZKAd5nGnuieZpf+CSTORYetswU1KeAsSbeVhSXzI7AKJtAi8oC4hir3BjohCogz0TVdRxXjozvqlb7RmznEzZ2Y5IEA9pDvF1rMDxZyIKmWFRurANiQHzhQGRm7gGhke8GmFHvCcfYrvtLDF6wCRY96IoSupkN+oNtO68f76vSmUX2bSyDNBU0gxOD8tqfkcz+enE2bR0hWToZMVGyfQlMktm/6IriQgWlNIUi1o51CTh1PRMAD0eFAFiRbHkDtYChKNEhORWBKjgZ7jssBwR5rA3/UGxnjqaDKdGnYJ1PjrZm6co7aqDwYhKT22C+8UQ6tsXpYrPKjtwsNKzlRfwwPgOOXpgln0J6O4YAu0M5C/sVKAOeukNwSTXPCQ5tai+F05o1DYsRKCVfhRBdOQziyWjDWNMdU2tqqL1qjdroYSnODBBy2JH2h5xwUAk1P+6JmWYZrP3EahC0o52cj7V/QmBw0ZdpaWFMABHrGtmYYqyDR41BAYqgZibv3BVW0jZ6g2YQHu5Bime8MdhrnxFl7xuVtABXeGGcnJw54H2rOTFRm0AIwGPSAd3HOQRysHBi3Ie/OHaK2HCtU9ct0oaXKDtnTk7+DLXcHZCPWZ0aqlabxJPpjre3vlIO2ApwTT/caiXl9pfYG0e1MBrAtT2RNgQRMQUyGugWU21nOzT5WivHCMF+ilOIiRaSqYnlW4qKRld4+IkEjK7YfPfrDIZAN44XnGiLX4J8aPHc3sRdgJoO1YczXM9kx1n2gvaAifUbH8rnEfoFpmaAUbXHxvC9ZjErK8s89Uey2Bb7X7fV6d6tnr8DHa7/KdhWIMbnjG1AyBmCyNCcLba32tf7oXur62vC/H6zce6VfRHnV2bN3F9bPkgSlARvrDsl6j/iOYcrqlTKtr8rrJZCVyeqlpMgjmH2QyB6zIr634O9oG07ASxNTv3mnln1w/QCXB0A2jbf3krXhcjHRzDUE85eQ0rx8bjYPuY9ZzketHr/hxKenHu60UIftUq7rHTpZ49sXb7y9eKNybKAEXbIUHctqnZvv+5Mf5fXdQINmCflx2/K3ONtFf78/IEKyIw7WQZagKC2ZF+ZvTJ1ilLxXVf0/mHq49xrVUn8cvxH4/RTziOAj5oWp/zhrH7F+QRs5rvqxe3Y3wH87v/+1PD4wfcA+zYr7z2+xWmb7wsdlY5ftK2UFj7j0nOMq8mP80ebik0/2AV7v04he36t+j1Hi4hD5uP73N0rKKI3LRranHzHRsVxfW9Ujon64Jtm2fMBHab6nd77eQr+RgdMgz6KUViDf6rXNtTZo4/HtHt8SA5Fnk6KkKbkkjQr9t1X6iL0tsn2+rm65Ff5ty60fW+5hVNICo+TN6rZ+6/Jckmz7xtH9It7wswD7VxbLLK3XasU+9ZPg1raX55LixKeEwWkViWHZNDsyNzZ/4yPBv3PdP7FliAm5nT2/dt//f00vSpseKsNaiSnD4n3G5FGONygitZs8fny7qP2BGWHK0BAzUVpSlPqYmQwbtYlmmH1tIK8nw5dPf/T3BWHYeclUC/bcbPKdXkNotxr33yZBFJe0mWCK2ABR1HxgsVHwpypGvyxxUhEUZiWteG/UFDifv52RL/VPX358bH5lP315l8zXegW3LCoBZftb4ik+vsPFfpgxdQNTGqXb+wq9TTM0Yz59+Sb018YV0riz8MGhUXv8V61yiSn7BvXpG5jfx2rfybmVMq8i6G3VacaAsXYjA+BtVFJcfKuLY0TDq02tuS+LJsl8RK6ZoGPJfFtSmC2m7G2IPSCyx8x/VhuGfWx+thLUpy+/Vcy+3l3uKFFQ2f+Tyv6V+YXZvTJswdQbxtXPoEWUbuvMzzdC3hfx9T3X9b2IN6oNXnu4/5Zl/V8EY35hrotUJAy7+VcTqP2o0bh/SWRYFu1p9nvS2hDnJDszVZfGbLKCuR225U1n98lKZY+CyAz6jI8LGm0iH1HcqHmoxJ0WwwYMy/zlL39hPn358P3hK/Mz8+nL+wbq67uq+mthYnxmUBp8G+v/Stc/6Ij/qZTvVasi9lvl/mOi/mPLmyzfSP2evZsDG+PzlcEPwH5B/4fAj6V5ty++e5vfn8SvPVtVHX4g9Kq67PN3JrU/MOZiuPhjEqJzgNM/PTN2VchwUJ3DfpYecFHVo6isnoeawVQltmCOIU6ZI2YI2qd+2Kj5iF43Rf0d0/eL19f37FdV6mud+fnn9yn8jih+lPN9fueVubeqd36XBc5RgZmP7fX/L5kCJxnFH92ue7/M/BjTslH7lT7ugXaDuF/Y/vqR1uenLsd9RybL/lT7rwAAAP//Frtxy3AaAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=internal.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.10
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=stable-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0ca491f03889e64a6-7t07bv6o.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://vpce-0504fafb159143d31-mrstnlzm.logs.us-east-1.vpce.amazonaws.com/"
                      group_name = "stable_internal"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - systemctl enable --now vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
          ~ content      = <<-EOT
                #!/bin/bash
                set -euo pipefail
                source /tmp/cloud_init_vars
                
                echo "Setting up worker services."
                
                # Prepare osbuild-composer's remote worker services and sockets.
                systemctl enable --now osbuild-remote-worker@${COMPOSER_HOST}:8700
              + 
              + # Now that everything is configured, ensure monit is monitoring everything.
              + systemctl enable --now monit
            EOT
            # (1 unchanged attribute hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "1e51c6c57948fa5bddcd1d1f45f3ee12b93fccf3daa86a30bb23e64ded796cc9" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=external.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.10
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=stable-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://logs.us-east-1.amazonaws.com/"
                  group_name = "stable_external"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - systemctl enable --now vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.10" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "9fe26860a7a21bf08b67daa3f71b7f6f6971f008b53dddf4f8c539f2cddf41e7" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=internal.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.10
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=stable-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0ca491f03889e64a6-7t07bv6o.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://vpce-0504fafb159143d31-mrstnlzm.logs.us-east-1.vpce.amazonaws.com/"
                  group_name = "stable_internal"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - systemctl enable --now vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.10" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-08d997480fcea25b8" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-08d997480fcea25b8" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0f0890d7291842f4e" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-10.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.10" -> (known after apply)
      ~ public_dns                   = "ec2-35-169-38-119.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "35.169.38.119" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_stable",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9RZ6XLiSLb+T0S/Q467ImYmagSSWGzc7YlBILFKgFZE3w4ipUyQUGqxMsVWXe9+Qyxuu8rVy42JuDP+A1KeLU9+55wvcTdNGE4YZx4z/AjigrAwgzmrxeEBox+AlxYJgvnx6U4dqrI0tbReR3fvKuUTZ+OchmnyCIQq/13luwrHvRb6rnKz3QtpltKQnWUhY9APYpywH8A6JDiBMX66C5OQVf315u5XLTOHCV3jnJMTP0VhsnkE917IXgmcQ2b4wGo+SQvE+WmyDjffVdQwxl8F9/1rmUqloDinjxUAOFBG8AiwL3LlywoAAFAarGDBgjQPTxitInw8y5Z/HLijNOByCkGn0+lIde0Eu8LRF+XysdeZd6ROp9PtzLuH7VoZDkl/3U3aoU8Gx9jJZSk3LZFMWiwy+qaAs3vUnZ32wtZtOUkwJ7OFmuFZHmoHbUH6D74zbdd0JZMQf2ore+34MVpvgva6OGpuoz38qMLW9Gja0qYZaKlyWOuLfjMcML9mzEniyUo4zoyoQcIsbcyXTGLxpvO8iYxOq3cKjhuvVTTVdngwh4eGI20LQ+X7i/lJ22Z4fQyd4iMd6h8D0crn0bgjFcXQnXv5lnxUAjuGk12+O5pTsaBTtktcaRt4s/1xei86sy3MxqjWDkz4PJOFvXJsWYqYLPzGbLPnN+Hca9HQU8zTvWbig1NvztsPz9l86qju2M82y5wYcDAYLw01YKfpvYqW+XSiWIvUEDq4c2xsAuZr+VQyidc0drP7+unEP0u6IvrdaWPK77Pmfv88C3Z7MWFePTMnM4YwG320m/x8lmTJ4mgYyTITT8rex6LgLQ6t+yRokySY5MvNFt/76TyZdZRDzSf1lmyMjpuwmPnS/mMkPLgFcdWF9QwlFu1Hk0jf9rKtuRBxUx0JrbR3T0cDv1FzmtFxPdkhldoBeha6i0HftqfZKd14fLtpuyGvL5QsWeo1Adubbk3/6NhH5q7dBz5f21MfdVKxv1wno+bJ1a3FaNRWlxFMDoe6fG9Nw0geaW1qbUWeP7W6xyM/XA+fTW8kSM31/RrVoa/nk0bPdy2kDGuCdNScliJs7/1l2OlPR2PNOy0U3qyz9cOBx8L86QnEcJvm/8oxCiCr+ml89xbvGInNptA+Y757wTxZ9oaCZsrN8t1wJglbhTSylmJK4WFgtvbTqLV4SLa15T1OZ9pcrqn8ftx4aI5B6hUIhm+cVfZ5yPCq7AjXsswgCx5BjcXZpbxXZY9Y7WBOz5H5ly7wCH65Bjo1JGs46a26U1Udmk8PdR+uH3geN8Wm2PAaQmN9v2566ybEPKr7bUH0H9pCW7xqd6fqbGrI+k39ft3E9RZC7caD0OTX0G94fL1Vb/ktVG973n0Li/hBQOsvnXdWXVk3nyYGzyaG0NUtNDJDqafbI8uwlqM5r1j6eY1n3UgYGZYu27LWmzvLxZJX6oY1kpY8sa2eNldF96TZUt+KmoInLnkcq02zF4l6P7A8UZcQr+uOlU08IRvBwXJrRoquW/vxnCgS4pfPum1r84gM5qZi65ZSR/whVPlmtlQQ9YWspy2WW8/R6kY/2JqR8DxfoJkt2y3T1pfYEmTb1Bawr03NRSahfVauNd6sRcrCtEc64u3EsXTHshVZlxUexerR2CqBXQ9ys883sZ215rwmWTyp64qyNCK2cyKSolibds8xj7qWpchLESmWrMhnWafdK5/nkaLNEyl3bMU1bE11T8HEcTLNskmCE0mfWpqkCqOJGqOh3pMO7kI5oe1m7NqjrR2pokbU5jIKDrplHaB1sB35oa72Rjre2icoZqlazw7mgAysbVC3iLubiNpIdYYHfyvZ2M5Mlz9AVfDrtp0d5/uU13p67NbTk7kgDU/RWrZgLy1BSuYRmcA+kqYDhfkkM1SnHbuOfsQD2zC77ORFS9lwWEOt+7l7UsZL2y7UWKOqgrIusXmnNxrowrKnE6SZorJbRnruKHZPT+yJMUBjy0F9c6CfDFmDjqPFiCDHUDKoRY0G4tFeJQp0zGHTPQWCt5CeVbsztuQldWS1sewr0JSFwFFIqJuSZix0R5W1oZFIdZ0nezchhWcTy+uyk57YotfTd3ZfOOJBusOLoOXLumhHwsyPlJE3zxqeSOs+sZk9sCO9byuWMOqaIpJUiwmuJRj2wA6MhaR7p1Hk1ZeH8alz0GP3NLcaR9vSJMTb0txRprYs9PUFGlo2kbtkaahyuzsnRNGjtL40l65aj/bLfpv6RnvskmXmRiRDol5YQifXIqE7lZGk2nZkLJDuWELXtZS+sUVEI5sTNqXIE/fjb+hKN119gZR52K5b1lKbW0J37riN9+vq8ILR+SaT9CQTNZEQg/ebnpJN/Gh4NB0BQlk5GDJRsXMIzDpxfNOv6yfSNe2RpSfa3kksXh0M67qg111eT1G8EXRL2xmKEnbjQ45MydWstrvkddEZaF2/3+4bg5GoymxmOAdTE+yxunD3Wp/uDEISZ+DnXj+z7IG6my6yvbcNDDs+MH9g7XRemJmmNbac0cDqsinc2tA/2bHOLxdQbtRNcyhYDrOnvdHYGwTEiBRqLYLhXDz0rL7dsCJNc02lqS06dbvfTKY9aWIQxGNbmk/nGW+JSJsnnbpm28bSeeA1y2pYcnY0ks4JDshOU0aNqT3SdZEdsaMZxgLF8ygQYT3QjHhZ+KJad4y2qDlE0LcBw7LQ6m413o3S5pjPmrqlCMYgPbgREnxLc8d1ZWzZuoW6bd07uUcUoYVrRU1LWE5cojZcO1Dnp9FUS5QtdEYHf2s1lltdNqL52Eg0ahoPdX+gNf2tstMWOu9Go0IjkTBfqO1ueOnJutWUh7KmWEQf6RHpzW1dufRyfvzlpDCMyWosu8aqo2tPME8e4Z4+UuznmNEYJnCD88eCchhSxgmP7Xr9vikK7ft2u32VesQHhvMEkpWfxllKcX5mmtymKfMb8+rOsCSjqw9n5nCqrdSO1ulfh1RH6/3fPdPCo34eZiUn564qnJ/GMUwQF81dkrZv/l3DlNXVYGqYWkeVVzNdVoaLJ8qgRzB32wF328GXSeoN9acaZn4tpV4REvSloCF3ddk0XnYma73ZdKiZK0ufPAWMZfSxVnu7terL1qowhqc0gXtakojaa9rwnsuvXlRZGpP32cRPUboNf74+QELSPUYrlMYwTCh4Aj+BO4ZhXL1arKb55u4f4C4ovKqX4/2X7/dpHuH86yVw8+BD8ATu3o/ah5yfs2qGS5p0je5i8E/H9++M402qd9hnaX79+K200rTIfUyr27QocYNujtkxw6Xr2/sb/cQHnxQIr4okZOeN3V19UJzvQh/f/fySExomEa2mBfvSJtzT1ZlC7iHzgxVJN/RmPkyygl0T9uL6JRs4QVkaJqw0csNiqf1NBN7MbvK0yFblxbJUvdTK6lYrNyHKcgzjF6mXHkCPlKSblwRcb79VP0XYP6eIpsldpZIXiR+jC1emR8pw7DMCcFL6AhyXpHtwSdVv3Mz/zB37wNEAE3JpG9+6ZP+l5oVJzYM0qFDMAIeLFGRhhtcwJJXL2b9P6Svfgz5mgAUYhAllMPExGPaqlaFmmB2tK6+GvacPf/OLnABuQkF5Go+1mtBqV8Vmo3r9rBHIMGW1GDPIIchg7WaLC9HfSx8dSnFcJihIKSszX60o1mTy0t6e7j58er/jfeY+fHoVzOe70twsL9GRFpfAE7x/ZRf7QQruDMxYmGyuJ/SyDFgKPnx64/pz9WzSuGbhC4Vq5fatPGWKGfdi6sMbM/8dp31NzmUKeWWCXk6dpUAfaJdk6HgTUobzt7jYhyw4y1RqBc1rJPUhOUcC9xS8nRVggxl3ecXtICkw+J+yYLhbZXMloD58+q0p9PmqcrUSolL+d4byZ/AL2D4DLgd3VeOsZ7A8TDZ34J+XhLyev6trrKvr/K2WBV65qf+W5N0fNAZ+AedDymPArf9oAJX3OML15zvAcbBg6X8T1no4I+mxRFrJsQBMEPBxzsJ16JdN44K3i9AZbdfxB7qd13LVigcpbjUAhwAHfvzxR/Dh0xd3/8/gn+DDp9cE6POr0fmFl1vTL4P6/4Pzu5T2dzH8hrS+Be3rpbtvSV9Q+ZLMd7J2VeHK5JS5+8q8n7N/g/nb0bwqj3f29p+C9YosGSvDnOqdvvxUQ3hXS3YxFhKhYpgdU74w7h3MayT0vmbdX4ylIvsVgpSlOdzgX8dQkd3egTR5katWwjX4C9jkOCuhdvP5GdSyPPVrcVokjP5QojupAPA9kBNa5BjIkgFCCtYFIceSFybYZxiBdZhTVq0AsE5zYA5VWQdhAj7x1Wqd5z//AFB65kHhGlAGGfjwavMvPso/L8cwOn9fh5ef8AnGGRAqAKA0wZVzKN0A+1Fpa6EY538+XIdsSAEkOYboCGKIcBnOeY+HNV2FyTr9lts4WtPqYU3frFfOIZz9qTB6aSTcqzxDhgEK8zM7O5au4pDSkuNVSpsozAH3NrcXcx2Eyul4JtzrklSeu9g54aXm5WQ/fHoVy+e3J1SGivAaFoRRwAP+DvwCGMaAg6+MljGUJt9u6hyAjks4GvIkTIrDhdwfGC1957hECvbTBHD6Dtzwd1ErsfQq2xnOz/tNk7OqH6T7UgusvszU41dv3kmKjfNwXTZTeOVNV8SGFOzz8My8KwCwtPCDN9q1apanu7AMI0w2K7+ERrmRcw/4XcF1+B/TD/4Iz3qv2i/3p+vg66BtQdmvqywFpGReSVn5ECRpwpXkC8EcgSzN2SXfIQUEUwpIGGFyLJU8XPkeUB8mCUZndGZ56mFUrXwPzGlv+rc4gEeEk78/Aqfky6WQ75cmSgDloV9yDVr6vPBpVl5YAcE7TABkgKZxaf886v4BvIKBPS7L+68MBHCHQchAHm4CBpJ0X628VNIZ2xfwoevnV42Rg1lYpakfYVZFtUpZFX9eLd3hPA8Rrvppsi7H5Lk7F4SAH38E8lSp/GScRX+uTM7JNc43wKe3T+2H+1alFP71UocgjtOEyzFJIbrcO3AG8697y1/LRMYpw+By03855fNZXOKk1VeWY0ijFysXnX8Jt7t15RvXypv8xdVV7ZqF39N5J3FfVRLHfVf53wAAAP//Bd41cZgeAAA=" -> "H4sIAAAAAAAA/9RZ6XLiSLb+T0S/Q467ImYmagSSWGzc7YlBILFKgFZE3w4ipUyQUGqxMsVWXe9+Qyxuu8rVy42JuDP+A1KeLU9+ec53TDdNGE4YZx4z/AjigrAwgzmrxeEBox+AlxYJgvnx6U4dqrI0tbReR3fvKuUTZ+OchmnyCIQq/13luwrHvRb6rnKz3QtpltKQnWUhY9APYpywH8A6JDiBMX66C5OQVf315u5XLTOHCV3jnJMTP0VhsnkE917IXgmcQ2b4wGo+SQvE+WmyDjffVdQwxl8F9/1rmUqloDinjxUAOFBG8AiwL3LlywoAAFAarGDBgjQPTxitInw8y5Z/HLijNOByCkGn0+lIde0Eu8LRF+XysdeZd6ROp9PtzLuH7VoZDkl/3U3aoU8Gx9jJZSk3LZFMWiwy+qaAs3vUnZ32wtZtOUkwJ7OFmuFZHmoHbUH6D74zbdd0JZMQf2ore+34MVpvgva6OGpuoz38qMLW9Gja0qYZaKlyWOuLfjMcML9mzEniyUo4zoyoQcIsbcyXTGLxpvO8iYxOq3cKjhuvVTTVdngwh4eGI20LQ+X7i/lJ22Z4fQyd4iMd6h8D0crn0bgjFcXQnXv5lnxUAjuGk12+O5pTsaBTtktcaRt4s/1xei86sy3MxqjWDkz4PJOFvXJsWYqYLPzGbLPnN+Hca9HQU8zTvWbig1NvztsPz9l86qju2M82y5wYcDAYLw01YKfpvYqW+XSiWIvUEDq4c2xsAuZr+VQyidc0drP7+unEP0u6IvrdaWPK77Pmfv88C3Z7MWFePTMnM4YwG320m/x8lmTJ4mgYyTITT8rex6LgLQ6t+yRokySY5MvNFt/76TyZdZRDzSf1lmyMjpuwmPnS/mMkPLgFcdWF9QwlFu1Hk0jf9rKtuRBxUx0JrbR3T0cDv1FzmtFxPdkhldoBeha6i0HftqfZKd14fLtpuyGvL5QsWeo1Adubbk3/6NhH5q7dBz5f21MfdVKxv1wno+bJ1a3FaNRWlxFMDoe6fG9Nw0geaW1qbUWeP7W6xyM/XA+fTW8kSM31/RrVoa/nk0bPdy2kDGuCdNScliJs7/1l2OlPR2PNOy0U3qyz9cOBx8L86QnEcJvm/8oxCiCr+ml89xbvGInNptA+Y757wTxZ9oaCZsrN8t1wJglbhTSylmJK4WFgtvbTqLV4SLa15T1OZ9pcrqn8ftx4aI5B6hUIhm+cVfZ5yPCqrAjXa5lBFjyCGouzy/VelTVitYM5PUfmX6rAI/jlGujUkKzhpLfqTlV1aD491H24fuB53BSbYsNrCI31/brprZsQ86jutwXRf2gLbfGq3Z2qs6kh6zf1+3UT11sItRsPQpNfQ7/h8fVWveW3UL3tefctLOIHAa2/dN5ZdWXdfJoYPJsYQle30MgMpZ5ujyzDWo7mvGLp5zWedSNhZFi6bMtab+4sF0teqRvWSFryxLZ62lwV3ZNmS30ragqeuORxrDbNXiTq/cDyRF1CvK47VjbxhGwEB8utGSm6bu3Hc6JIiF8+67atzSMymJuKrVtKHfGHUOWb2VJB1BeynrZYbj1Hqxv9YGtGwvN8gWa2bLdMW19iS5BtU1vAvjY1F5mE9lm51nizFikL0x7piLcTx9Idy1ZkXVZ4FKtHY6sEdj3IzT7fxHbWmvOaZPGkrivK0ojYzolIimJt2j3HPOpaliIvRaRYsiKfZZ12r3yeR4o2T6TcsRXXsDXVPQUTx8k0yyYJTiR9ammSKowmaoyGek86uAvlhLabsWuPtnakihpRm8soOOiWdYDWwXbkh7raG+l4a5+gmKVqPTuYAzKwtkHdIu5uImoj1Rke/K1kYzszXf4AVcGv23Z2nO9TXuvpsVtPT+aCNDxFa9mCvbQEKZlHZAL7SJoOFOaTzFCdduw6+hEPbMPsspMXLWXDYQ217ufuSRkvbbtQY42qCsq6xOad3migC8ueTpBmispuGem5o9g9PbEnxgCNLQf1zYF+MmQNOo4WI4IcQ8mgFjUaiEd7lSjQMYdN9xQI3kJ6Vu3O2JKX1JHVxrKvQFMWAkchoW5KmrHQHVXWhkYi1XWe7N2EFJ5NLK/LTnpii15P39l94YgH6Q4vgpYv66IdCTM/UkbePGt4Iq37xGb2wI70vq1YwqhrikhSLSa4lmDYAzswFpLunUaRV18exqfOQY/d09xqHG1LkxBvS3NHmdqy0NcXaGjZRO6SpaHK7e6cEEWP0vrSXLpqPdov+23qG+2xS5aZG5EMiXphCZ1ci4TuVEaSatuRsUC6Ywld11L6xhYRjWxO2JQiT9yPv6Er3XT1BVLmYbtuWUttbgndueM23r9XhxeMzjeZpCeZqImEGLzf9JRs4kfDo+kIEMrKwZCJip1DYNaJ45t+XT+RrmmPLD3R9k5i8epgWNcFve7yeorijaBb2s5QlLAbH3JkSq5mtd0lr4vOQOv6/XbfGIxEVWYzwzmYmmCP1YW71/p0ZxCSOAM/9/qZZQ/U3XSR7b1tYNjxgfkDa6fzwsw0rbHljAZWl03h1ob+yY51frmAcqNumkPBcpg97Y3G3iAgRqRQaxEM5+KhZ/XthhVpmmsqTW3Rqdv9ZjLtSRODIB7b0nw6z3hLRNo86dQ12zaWzgOvWVbDkrOjkXROcEB2mjJqTO2RrovsiB3NMBYonkeBCOuBZsTLwhfVumO0Rc0hgr4NGJaFVner8W6UNsd81tQtRTAG6cGNkOBbmjuuK2PL1i3UbeveyT2iCC1cK2pawnLiErXh2oE6P42mWqJsoTM6+FursdzqshHNx0aiUdN4qPsDrelvlZ220Hk3GhUaiYT5Qm13w0tN1q2mPJQ1xSL6SI9Ib27ryqWW8+MvO4VhTFZj2TVWHV17gnnyCPf0kWI/x4zGMIEbnD8WlMOQMk54bNfr901RaN+32+2r1CM+MJwnkKz8NM5SivMz0+Q2TZnfmFd3hiUZXX04M4dTbaV2tE7/2qQ6Wu//7pkWHvXzMCs5OXdV4fw0jmGCuGjukrR98+8apqyuBlPD1DqqvJrpsjJcPFEGPYK52w642w6+TFJvqD/VMPNrKfWKkKAvBQ25q8um8bIzWevNpkPNXFn65ClgLKOPtdrbrVVftlaFMTylCdzTkkTUXtOG91x+9aLK0pi8zyZ+itJt+PP1ARKS7jFaoTSGYULBE/gJ3DEM4+rVYjXNN3f/AHdB4VW9HO+/fL9P8wjnXy+Bmwcfgidw937UPuT8nFUzXNKka3QXg386vn9nHG9SvcM+S/Prx2+llaZF7mNa3aZFiRt0c8yOGS5d397f6Cc++KRAeFUkITtv7O7qg+J8F/r47ueXnNAwiWg1LdiXNuGers4Ucg+ZH6xIuqE382GSFeyasBfXL9nACcrSMGGlkRsWS+1vIvBmdpOnRbYqB8tS9XJXVre7chOiLMcwfpF6qQH0SEm6eUnAdfqt+inC/jlFNE3uKpW8SPwYXbgyPVKGY58RgJPSF+C4JN2DS6p+YzL/MzP2gaMBJuRSNr41ZP+l5oVJzYM0qFDMAIeLFGRhhtcwJJXL2b9P6Svfgz5mgAUYhAllMPExGPaqlaFmmB2tK6+GvacPf/OLnABuQkF5Go+1mtBqV8Vmo3r9rBHIMGW1GDPIIchg7WaLC9HfSx8dSnFcJihIKSszX60o1mTyUt6e7j58er/ifeY+fHoVzOe70twsL9GRFpfAE7x/ZRf7QQruDMxYmGyuJ/SyDFgKPnx64/pz9WzSuGbhC4Vq5fatPGWKGfdi6sMbM/8dp31NzqULeWWCXk6dpUAfaJdk6HgTUobzt7jYhyw4y1RqBc1rJPUhOUcC9xS87RVggxl3ecXtICkw+J/ywnC3m82VgPrw6be60OerytVKiEr532nKn8EvYPsMuBzcVY2znsHyMNncgX9eEvK6/66usa6u/bdaXvDKTf23JO/+oDHwCzgfUh4Dbv1HA6i8xxGu/74DHAcLlv43Ya2HM5IeS6SVHAvABAEf5yxch35ZNC54uwid0XZtf6DbeS1XrXiQ4lYDcAhw4McffwQfPn0x+38G/wQfPr0mQJ9ftc4vvNyKfhnU/x+c36W0v4vhN6T1LWhfL919S/qCypdkvpO1qwpXJqfM3Vfm/Zz9G8zfjubV9Xhnb/8pWK/IkrEyzKne6ctPNYR3tWQXYyERKobZMeUL497BvEZC72vW/UVbKrJfIUhZmsMN/rUNFdntHUiTF7lqJVyDv4BNjrMSajefn0Ety1O/FqdFwugPJbqTCgDfAzmhRY6BLBkgpGBdEHIseWGCfYYRWIc5ZdUKAOs0B+ZQlXUQJuATX63Wef7zDwClZx4UrgFlkIEPrzb/4qP883IMo/P3dXj5Fz7BOANCBQCUJrhyDqUbYD8qbS0U4/zjw7XJhhRAkmOIjiCGCJfhnPd4WNNVmKzTb7mNozWtHtb0zXrlHMLZnwqjl0LCvcozZBigMD+zs2PpKg4pLTlepbSJwhxwb3N7MddBqOyOZ8K9LknluYqdE15qXk72w6dXsXx+e0JlqAivYUEYBTzg78AvgGEMOPjKaBlDafLtps4B6LiEoyFPwqQ4XMj9gdHSd45LpGA/TQCn78ANfxe1Ekuvsp3h/LzfNDmr+kG6L7XA6stMPX715p2k2DgP12UxhVfedEVsSME+D8/MuwIASws/eKNdq2Z5ugvLMMJks/JLaJQbOdeA3xVch/8x9eCP8Kz3bvtlfro2vg7aFpT9uspSQErmlZQ3H4IkTbiSfCGYI5ClObvkO6SAYEoBCSNMjqWShyvfA+rDJMHojM4sTz2MqpXvgTntTf8WB/CIcPL3R+CUfLkU8v3SRAmgPPRLrkFLnxc+zcqBFRC8wwRABmgal/bPre4fwCsY2OPyev+VgQDuMAgZyMNNwECS7quVl5t0xvYFfOj6+VVh5GAWVmnqR5hVUa1S3oo/r5bucJ6HCFf9NFmXbfJcnQtCwI8/AnmqVH4yzqI/Vybn5BrnCfDp7VP74b5VKYV/HeoQxHGacDkmKUSXuQNnMP+6tvy1TGScMgwuk/7LKZ/P4hInrb6yHEMavVi56PxLuM3WlW+MlTf5i6ur2jULv6fzTuLKDWnp/gIpvMP5kQXniYCCy6+1RY7RPwC+9JE4TcIz8s5f0pKRvFKqfsv/WfqrO8tx31X+NwAA//8YmL02Ah8AAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-006abcb539c009c0c",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (stable)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-04cdca8908908504f" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0c265ef95baf28098" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0487676f48bf9a178" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0487676f48bf9a178" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0df7102235a986cee" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-10.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.10" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data_base64             = "H4sIAAAAAAAA/9RZaXPqyLn+TtX8h47nVCWpE4EWwMYzTgWBxCphtCJyU1RL3SCh1nLULbYz57/fEovHPsez3UrVTfwFS/1u/fTT7wK9LGU4ZZx1zPEjSErCohwWrJFEB4x+AH5WpggWx6c7baQp8szW+13Du6tVT5yDCxpl6SMQ6vx3te9qHPda6LvazXY/onlGI3aWhYzBIExwyn4A64jgFCb46S5KI1YP1pu7n7WsAqZ0jQtOSYMMRenmEdz7EXslcA6Z4QNrBCQrERdk6TrafFfTogR/E9z3r2VqtZLigj7WAOBAFcEjwIHIVS9rAABAabiCJQuzIjphtIrx8Sxb/XHgjtKQKygE3W63K0v6CfaEYyAq1WO/O+/K3W631533Dtu1OhqRwbqXdqKADI+JWyhyYdkimbZZbA4sAef3qPd82gtbr+2m4Zw8L7QcPxeRftAXZPAQuLNOw1BzGfGnjrrXjx/j9SbsrMuj7jU7o48abM+OliNvWqGeqYe1sRi0oiELGuacpL6iRpPcjJskyrPmfMlklmy6nzax2W33T+Fx47fLltaJDtbo0HTlbWlq/GAxP+nbHK+PkVt+pCPjYyjaxTyedOWyHHlzv9iSj2roJHC6K3ZHayaWdMZ2qSdvQ/95f5zdi+7zFuYT1OiEFvz0rAh79di2VTFdBM3nzZ7fRHO/TSNftU73uoUPrtSadx4+5fOZq3mTIN8sC2LC4XCyNLWQnWb3GloWs6lqLzJT6OLusbkJWaAXM9kifsvcPd9LpxP/STZUMejNmjN+n7f2+0/P4W4vpsyXcmv6zBBm449Oi58/p3m6OJpmuszFk7oPsCj4i0P7Pg07JA2nxXKzxfdBNk+fu+qhERCprZjj4yYqnwN5/zEWHrySeNrC/gRlFu/H09jY9vOttRBxSxsL7ax/T8fDoNlwW/FxPd0hjToh+iT0FsOB48zyU7bx+U7L8SLeWKh5ujQaAnY2vYbx0XWOzFt7D3yxdmYB6mbiYLlOx62TZ9iL8bijLWOYHg6Scm/PolgZ6x1qb0WeP7V7xyM/Wo8+Wf5YkFvr+zWSYGAU02Y/8GykjhqCfNTdtips74Nl1B3MxhPdPy1U3pLY+uHAY2H+9AQSuM2KfxQYhZDVgyy5e8t3jMRWS+icOd+7cJ4s+yNBt5RW9W70LAtblTTztmrJ0WFotfezuL14SLeN5T3OnvW50tD4/aT50JqAzC8RjN44q+2LiOFVlRGu1zKHLHwEDZbkl+u9qnLEagcLeo4suGSBR/DTNdCZKdujaX/Vm2nayHp6kAK4fuB53BJbYtNvCs31/brlr1sQ80gKOoIYPHSEjnjV7s2055mpGDf1+3ULS22EOs0HocWvYdD0eakttYM2kjq+f9/GIn4Q0Ppr591VTzGsp6nJs6kp9Awbja1I7hvO2Dbt5XjOq7ZxXuNZLxbGpm0ojqL35+5yseRVybTH8pInjt3X55ronXRHHthxS/DFJY8TrWX1Y9EYhLYvGjLiDcO186kv5GM4XG6tWDUMez+ZE1VG/PKT4Tj6PCbDuaU6hq1KiD9EGt/KlyqigZD39cVy67u6ZA7CrRULn+YL9OwoTttyjCW2BcWx9AUc6DNrkcton1drzTdrsbqwnLGBeCd1bcO1HVUxFJVHiXY0t2roSGFhDfgWdvL2nNdlmyeSoapLM2Y7NyYZSvRZ7xzzuGfbqrIUkWorqnKWdTv96nkeq/o8lQvXUT3T0TXvFE5dN9dth6Q4lY2ZrcuaMJ5qCRoZffngLdQT2m4mnjPeOrEm6kRrLePwYNj2AdoHx1UeJK0/NvDWOUExzzQpP1hDMrS3oWQTbzcV9bHmjg7BVnawk1sef4CaEEiOkx/n+4zX+0biSdnJWpCmr+ptR3CWtiCn85hM4QDJs6HKApKbmttJPNc44qFjWj128uOlYrqsqUlB4Z3UydJxSi3RqaaivEcc3u2Ph4aw7BsE6Zao7paxUbiq0zdSZ2oO0cR20cAaGidT0aHr6gkiyDXVHOpxs4l4tNeICl1r1PJOoeAv5E+a053YypK6itZcDlRoKULoqiQyLFk3F4arKfrITGXJ4MneS0npO8T2e+xkpI7o942dMxCOeJjt8CJsB4ohOrHwHMTq2J/nTV+kUkAc5gyd2Bg4qi2Me5aIZM1mgmcLpjN0QnMhG/5pHPvS8jA5dQ9G4p3mdvPo2LqMeEeeu+rMUYSBsUAj2yFKjyxNTen05oSoRpxJS2vpaVK8Xw46NDA7E48scy8mORKN0ha6hR4LvZmCZM1xYnOBDNcWep6tDswtIjrZnLAlx764n/yCrnzTNRZInUcdybaX+twWenPXa75/rw4vHJ1vctlIc1EXCTH5oOWr+TSIR0fLFSBU1IOpEA27h9CSiBtYgWScSM9yxraR6ns3tXltOJIMwZA83shQshEMW9+Zqhr1kkOBLNnT7Y635A3RHeq9YNAZmMOxqCns2XQPli44E23h7fUB3ZmEpO4wKPxBbjtDbTdb5Ht/G5pOcmDB0N4ZvPBsWfbEdsdDu8dmcOvA4OQkBr9cQKUpWdZIsF3mzPrjiT8MiRmr1F6Eo7l46NsDp2nHuu5ZaktfdCVn0EpnfXlqEsRjR57P5jlvi0ifp11Jdxxz6T7wum03bSU/mmn3BIdkp6vj5swZG4bIjtjVTXOBknkcilAKdTNZloGoSa7ZEXWXCMY2ZFgR2r2tzntx1prwecuwVcEcZgcvRkJg695EUie2Y9io1zH8k3dEMVp4dtyyheXUI1rTc0JtfhrP9FTdQnd8CLZ2c7k1FDOeT8xUp5b5IAVDvRVs1Z2+MHgvHpc6iYX5Quv0oktONuyWMlJ01SbG2IhJf+4Y6iWX85OvK4VpTlcTxTNXXUN/gkX6CPf0keKgwIwmMIUbXDyWlMOQMk547EjSfUsUOvedTucq9RilDBcpJKsgS/KM4uLcaXI02xXN+OrOtGWzZ4yerdFMX2ldvTu4Fqmu3v+/e6alT4MiyquenLuqcEGWJDBFXDz3SNa5+fdMS9FWw5lp6V1NWT0bijpaPFEGfYK52w642w6+Bqk/Mp4amAWNjPplRNDXgqbSMxTLfNmZovefZyPdWtnG9ClkLKePjcYuDzDHB7DZEda89PDQwe0mbHP3jL/3d+2s/nbr9Zet1yvFOkzgKUvhnladRuN1b/FeXN+8qLMsIe+3HP+Ms230r+sDJCTbY7RCWQKjlIIn8E9wxzBM6leL9azY3P0N3IWlX/cLvP/6/T4rYlx8uwRuHgIInsDd+1EHkAsKVs9x1Utdo7sY/MPx/TvjeAP1DgcsK64fvwYrzcoiwLS+zcqKXOjmmB1zXLm+vb/1qPgQkBLhVZlG7Lyxu6sPiotdFOC7f71gQqM0pvWsZF/bhHu6OveZe8iCcEWyDb2Zj9K8ZFfAXly/oIFTlGdRyiojbwnb4ptruPaFVkdoSkgSuKSgLCWnpF5Z/3Wa3nxviqzMV9WIWtm/3LrV7dbdhCgrMExepF6yCT1Skm1eULrO0fUgQzg440iz9K5WK8o0SNCl66ZHynASMAJwWvkCHJdme3DB81dm/D8yrR84GmJCLgnol8b1PzX8KG34kIY1ihngcJmBPMrxGkakdiHI+8NB7XswwAywEIMopQymAQajfr020k2rq/eU1aj/9OEvQVkQwE0pqI7ssdEQ2p262GrWr58NAhmmrJFgBjkEGWzcbHER+mvlo0spTiqAwoyyCvl6TbWn05dE+XT34fP7ufML9+Hzq2C+3FXmnouKQll5CTzF+1d2cRBm4M7EjEXp5npCL8uAZeDD5zeuv9TPJs0rCl8p1Gu3/6pTpphxL6Y+vDHz33HaV3Au9cyvAHo5dZYBY6hfwDDwJqIMF295sY9YeJapNUpaNEgWQHKOBO4peFtVwAYz7vKK20FSYvA/1YXhbtefqwj14fOv1bMvV5WrlQhV8r9R3r+An8D2E+AKcFc3z3omK6J0cwf+fgHkdSVfXWNdXSt5vbrgtZv6r0ne/U5j4CdwPqQiAdz69wZQe6/buH4RCDgOliz7b+JaH+ckO1ZMq7o1AFMEAlywaB0FVdK48O0idGbbtUaCXve1XL3mQ4rbTcAhwIEff/wRfPj81bcIX8DfwYfPr1upL6/q61debkm/Cur/j87vNse/yeE37e9b0r5euvsl6QsrX8B8B7WrCleBU2H3jfmgYP8G87ejeXU93tnbfwrXa4psrkxrZnQHylMD4V0j3SVYSIWaaXUt5dK772DRIJH/bf/+VVkq858pSFlWwA3+uQyV+e0dyNIXuXotWoM/gU2B84pqN59fQCMvsqCRZGXK6A8Vu9MaAN8DJaVlgYEimyCiYF0ScqyaxxQHDCOwjgrK6jUA1lkBrJGmGCBKwWe+Xpd4/ssPAGXnPihaA8ogAx9ebf7FR/XnFxhehq91dPkxgGCcA6EGAMpSXDuH0gtxEFe2Fqp5/hnjWmQjCiApMERHkECEq3DOezys6SpK19kvuU3iNa0f1vTNeu0cwtmfBuOXRMK9whkyDFBUnLuzY+UqiSiterxaZRNFBeDeYnsx10Woqo7nrnxdNZXnLHYGvNK8nOyHz69i+fL2hKpQEV7DkjAKeMDfgZ8Awxhw8JXRKobK5NtNnQMwcEVHU5lGaXm4TAAHRivfBa6YgoMsBZyxAzf+XdQqLr1CO8fFeb9ZelYNwmxfaYHV10g9fvPmHVAcXETrKpnCa990ZWxEwb6Izp13DQCWlUH4RrtRz4tsF1VhROlmFVTUqDZyzgG/KbiO/mPywe/ps9677Zch61r4umhbUvbzKssAqTqvtLr5EKRZylXNF4IFAnlWsAveEQUEUwpIFGNyrJR8XPse0ACmKUZnduZF5mNUr30PrFl/9pckhEeE078+ArfqlyuhIKhMVAQqoqDqNWjl89JPs2qqBQTvMAGQAZollf1zqfsb8EsG9ri63n9mIIQ7DCIGimgTMpBm+3rt5SaduX0hH7p+fpMYOZhHdZoFMWZ11KhVt+KPq2U7XBQRwvUgS9dVmTxn55IQ8OOPQJmptX+aZ9F/1aZncM3zBPj09qnzcN+uVcI/D3UI4iRLuQKTDKLL3IFzWHybW/5cAZlkDIPL1wEvp3w+i0uctP7KcgJp/GLlovMP4TaA135hrLzJX1xd1a4o/JbOO8B9c5M47rva/wYAAP//QzEAMeIeAAA=" -> "H4sIAAAAAAAA/9RZ6XLiSLb+T0S/Q467ImYmagQSAmzc7YlBILFKgFZE3w4ipUyQUGqxMsVWXe9+Qyxuu8rVy42JuDP+g6U8W5788pzvQDdNGE4YZx4z/AjigrAwgzmrxeEBox+AlxYJgvnx6U4dqrI0tbReR3fvKuUTZ+OchmnyCIQq/13luwrHvRb6rnKz3QtpltKQnWUhY9APYpywH8A6JDiBMX66C5OQVf315u5XLTOHCV3jnJMTP0VhsnkE917IXgmcQ2b4wGo+SQvE+WmyDjffVdQwxl8F9/1rmUqloDinjxUAOFBG8AiwX+fKlxUAAKA0WMGCBWkenjBaRfh4li3/OHBHacDlFIJOp9ORRO0Eu8LRr8vlY68z70idTqfbmXcP27UyHJL+upu0Q58MjrGTy1JuWnUyabHI6JsCzu5Rd3baC1u35STBnMwWaoZneagdtAXpP/jOtF3TlUxC/Kmt7LXjx2i9Cdrr4qi5jfbwowpb06NpS5tmoKXKYa0v+s1wwPyaMSeJJyvhODOiBgmztDFfMonFm87zJjI6rd4pOG68VtFU2+HBHB4ajrQtDJXvL+YnbZvh9TF0io90qH8M6lY+j8YdqSiG7tzLt+SjEtgxnOzy3dGc1gs6ZbvElbaBN9sfp/d1Z7aF2RjV2oEJn2eysFeOLUupJwu/Mdvs+U0491o09BTzdK+Z+OCIzXn74TmbTx3VHfvZZpkTAw4G46WhBuw0vVfRMp9OFGuRGkIHd46NTcB8LZ9KJvGaxm52L55O/LOkK3W/O21M+X3W3O+fZ8FuX0+YJ2bmZMYQZqOPdpOfz5IsWRwNI1lm9ZOy93Fd8BaH1n0StEkSTPLlZovv/XSezDrKoeYTsSUbo+MmLGa+tP8YCQ9uQVx1YT1DiUX70STSt71say7quKmOhFbau6ejgd+oOc3ouJ7skErtAD0L3cWgb9vT7JRuPL7dtN2Q1xdKliz1moDtTbemf3TsI3PX7gOfr+2pjzppvb9cJ6PmydWtxWjUVpcRTA4HUb63pmEkj7Q2tbZ1nj+1uscjP1wPn01vJEjN9f0aidDX80mj57sWUoY1QTpqTksRtvf+Muz0p6Ox5p0WCm+KbP1w4LEwf3oCMdym+b9yjALIqn4a373FO0b1ZlNonzHfvWCeLHtDQTPlZvluOJOErUIaWUsxpfAwMFv7adRaPCTb2vIepzNtLtdUfj9uPDTHIPUKBMM3zir7PGR4VVaE67XMIAseQY3F2eV6r8oasdrBnJ4j8y9V4BH8cg10akjWcNJbdaeqOjSfHkQfrh94HjfrzXrDawiN9f266a2bEPNI9NtC3X9oC+36Vbs7VWdTQ9Zv6vfrJhZbCLUbD0KTX0O/4fFiS2z5LSS2Pe++hev4QUDrL513Vl1ZN58mBs8mhtDVLTQyQ6mn2yPLsJajOa9Y+nmNZ91IGBmWLtuy1ps7y8WSV0TDGklLnthWT5urdfek2VLfipqCV1/yOFabZi+q6/3A8uq6hHhdd6xs4gnZCA6WWzNSdN3aj+dEkRC/fNZtW5tHZDA3FVu3FBHxh1Dlm9lSQdQXsp62WG49RxONfrA1I+F5vkAzW7Zbpq0vsSXItqktYF+bmotMQvusXGu8WYuUhWmPdMTbiWPpjmUrsi4rPIrVo7FVAlsMcrPPN7Gdtea8Jlk8EXVFWRoR2zkRSVGsTbvnmEddy1LkZR0plqzIZ1mn3Suf55GizRMpd2zFNWxNdU/BxHEyzbJJghNJn1qapAqjiRqjod6TDu5COaHtZuzao60dqXWNqM1lFBx0yzpA62A78oOo9kY63tonWM9SVcwO5oAMrG0gWsTdTeraSHWGB38r2djOTJc/QFXwRdvOjvN9yms9PXbF9GQuSMNTtJYt2EtLkJJ5RCawj6TpQGE+yQzVaceuox/xwDbMLjt50VI2HNZQRT93T8p4aduFGmtUVVDWJTbv9EYDXVj2dII0s67slpGeO4rd0xN7YgzQ2HJQ3xzoJ0PWoONoMSLIMZQMalGjgXi0V4kCHXPYdE+B4C2kZ9XujC15SR1ZbSz7CjRlIXAUEuqmpBkL3VFlbWgkkqjzZO8mpPBsYnlddtITu+719J3dF454kO7wImj5sl63I2HmR8rIm2cNr05Fn9jMHtiR3rcVSxh1zTqSVIsJriUY9sAOjIWke6dR5InLw/jUOeixe5pbjaNtaRLibWnuKFNbFvr6Ag0tm8hdsjRUud2dE6LoUSouzaWritF+2W9T32iPXbLM3IhkqK4XltDJtUjoTmUkqbYdGQukO5bQdS2lb2wR0cjmhE0p8ur78Td0pZuuvkDKPGyLlrXU5pbQnTtu4/17dXjB6HyTSXqS1bU6IQbvNz0lm/jR8Gg6AoSycjBkomLnEJgicXzTF/UT6Zr2yNITbe8kFq8OhqIu6KLL6ymKN4JuaTtDUcJufMiRKbma1XaXvF53BlrX77f7xmBUV2U2M5yDqQn2WF24e61PdwYhiTPwc6+fWfZA3U0X2d7bBoYdH5g/sHY6L8xM0xpbzmhgddkUbm3on+xY55cLKDdE0xwKlsPsaW809gYBMSKFWotgOK8felbfbliRprmm0tQWHdHuN5NpT5oYBPHYlubTecZbdaTNk46o2baxdB54zbIalpwdjaRzggOy05RRY2qPdL3OjtjRDGOB4nkU1KEYaEa8LPy6KjpGu645RNC3AcOy0OpuNd6N0uaYz5q6pQjGID24ERJ8S3PHojK2bN1C3bbundwjitDCtaKmJSwnLlEbrh2o89NoqiXKFjqjg7+1GsutLhvRfGwkGjWNB9EfaE1/q+y0hc670ajQSCTMF2q7G15qsm415aGsKRbRR3pEenNbVy61nB9/2SkMY7Iay66x6ujaE8yTR7injxT7OWY0hgnc4PyxoByGlHHCY1sU75t1oX3fbrevUo9hwnCeQLLy0zhLKc7PTJOj6S5vRFd3hiUZXX04M4dTbaV2tE7/2qQ6Wu//7pkWHvXzMCs5OXdV4fw0jmGCuGjukrR98+8apqyuBlPD1DqqvJrpsjJcPFEGPYK52w642w6+TFJvqD/VMPNrKfWKkKAvBQ25q8um8bIzWevNpkPNXFn65ClgLKOPtdou8zHH+7DRFta8+PDQxq0GbHH3jL/3dq20+nbr1ZetV0vFKozhKU3gnpZMo/aaW7wX11cvqiyNyfuU46co3YY/Xx8gIekeoxVKYxgmFDyBn8AdwzCuXi1W03xz9w9wFxRe1cvx/sv3+zSPcP71Erh58CF4AnfvR+1Dzs9ZNcMll7pGdzH4p+P7d8bxJtU77LM0v378VlppWuQ+ptVtWpTgQjfH7Jjh0vXt/Y2j4oNPCoRXRRKy88burj4oznehj+9+fskJDZOIVtOCfWkT7unqzDP3kPnBiqQbejMfJlnBrgl7cf2SDZygLA0TVhp5C9gm31jDtSc020JDRKLAxTllCTnF1dL6b8P05nuTp0W2KkfU0v7l1q1ut+4mRFmOYfwi9VJN6JGSdPOSpescXfVThP1zHmma3FUqeZH4MbqwbnqkDMc+IwAnpS/AcUm6B5d8/saM/2em9QNHA0zIpQB9a1z/S80Lk5oHaVChmAEOFynIwgyvYUgqF4C8PxxUvgd9zAALMAgTymDiYzDsVStDzTA7WldeDXtPH/7mFzkB3ISC8sgeazWh1a7Wm43q9bNGIMOU1WLMIIcgg7WbLS5Efy99dCjFcZmgIKWszHy1oliTyUuhfLr78On92vmZ+/DpVTCf70pzs7yEUFpcAk/w/pVd7AcpuDMwY2GyuZ7QyzJgKfjw6Y3rz9WzSeOahS8UqpXbf+UpU8y4F1Mf3pj57zjta3Iu/cwrE/Ry6iwF+kC7JEPHm5AynL/FxT5kwVmmUitoXiOpD8k5Erin4G1XARvMuMsrbgdJgcH/lBeGu11/rgTUh0+/1c8+X1WuVkJUyv9Oe/8MfgHbZ8Dl4K5qnPUMlofJ5g7885KQ1518dY11de3k1fKCV27qvyV59weNgV/A+ZDyGHDrPxpA5T22cf0iEHAcLFj634S1Hs5IeiyRVrI1ABMEfJyzcB36ZdG44O0idEbbtUeCbue1XLXiQYpbDcAhwIEff/wRfPj0xbcIn8E/wYdPr6nU51f99Qsvt6JfBvX/B+d3yfHvYvgN/X0L2tdLd9+SvqDyJZnvZO2qwpXJKXP3lXk/Z/8G87ejeXU93tnbfwrWK7JkrAxzqnf68lMN4V0t2cVYSISKYXZM+cLddzCvkdD7mr9/0ZaK7FcIUpbmcIN/bUNFdnsH0uRFrloJ1+AvYJPjrITazednUMvy1K/FaZEw+kOJ7qQCwPdATmiRYyBLBggpWBeEHEvymGCfYQTWYU5ZtQLAOs2BOVRlHYQJ+MRXqyLPf/4BoPTMg8I1oAwy8OHV5l98lH9ejuFl+FqHlx8DCMYZECoAoDTBlXMo3QD7UWlroRjnnzGuTTakAJIcQ3QEMUS4DOe8x8OarsJknX7LbRytafWwpm/WK+cQzv5UGL0UEu5VniHDAIX5mZ0dS1dxSGnJ8SqlTRTmgHub24u5DkJldzyz8nVJKs9V7JzwUvNysh8+vYrl89sTKkNFeA0LwijgAX8HfgEMY8DBV0bLGEqTbzd1DkDHJRwNeRImxeEyARwYLX3nuEQK9tMEcPoO3PB3USux9CrbGc7P+02Ts6ofpPtSC6y+zNTjV2/eSYqN83BdFlN45U1XxIYU7PPwzLwrALC08IM32rVqlqe7sAwjTDYrv4RGuZFzDfhdwXX4H1MP/gjPeu+2X4asa+ProG1B2a+rLAWkZF5JefMhSNKEK8kXgjkCWZqzS75DCgimFJAwwuRYKnm48j2gPkwSjM7ozPLUw6ha+R6Y0970b3EAjwgnf38ETsmXSyHfL02UAMpDv+QatPR54dOsnGoBwTtMAGSApnFp/9zq/gG8goE9Lq/3XxkI4A6DkIE83AQMJOm+Wnm5SWdsX8CHrp9fFUYOZmGVpn6EWRXVKuWt+PNq6Q7neYhw1U+Tddkmz9W5IAT8+COQp0rlJ+Ms+nNlck6ucZ4An94+tR/uW5VS+NehDkEcpwmXY5JCdJk7cAbzr2vLX8tExinD4PJ1wMspn8/iEietvrIcQxq9WLno/Eu4DeCVb4yVN/mLq6vaNQu/p/NO4soNaen+Aim8w/mRBeeJgILL775FjtE/AL70kThNwjPyzv+kJSN5pVT9lv+z9Fd3luO+q/xvAAAA///8rK0TTB8AAA==" # forces replacement
      ~ vpc_security_group_ids       = [
          - "sg-02523067c19e4d4ba",
          - "sg-07a88a5868e40dd45",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (stable)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0789bee2463abeaba" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-07a8146353741063f" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 6 -> (known after apply)
        id                      = "lt-0a0bd62efe297d67e"
      ~ latest_version          = 6 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_stable"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4aY/juLX2dwPzH/R6GngT9JWtxXaVK1ODWLbkVbJFidpyA0MLbcmilpIobz393y/kpVJdXT1JkAtcTH1xkTwbHz6H51DDLCUoJbR+ytETlVSYRLlbkHYSHVHwF8rLqjRwi9NzU57KorCEymgA7GajHtEGKsooS58otsX81PipQdNvhX5q3G2PojLPyohcZF1CXD9MUEr+Qm0ijFI3Qc/NKI1Iy99sm//Q0gs3LTeooMXUz4Io3T5RD15E3ghcQiboSNo+zqqA9rN0E21/ashRgr4L7ue3Mo1GVaKifGpQFE3VETxRyOfoerJBURRVluHarUiYFdEZBesYnS6y9R9NNcsypIvSpQaDwUDglbM7ZE8+J9bD0UAdCIPBYDhQh8fdRppO8XgzTPuRjyenxCxEodAhhxc9EmtjnUX5QzBcnQ/szu6ZaajilSXnaFVEylGx8PjRN5f9NpByIWDOfemgnD7Hm23Y31Qnxe70p59lt7c86Yaw7YZKJh03wBp3ownx25qKU0+UonmuxR0c5VlHdYhAku3gZRtrg97oHJ62Xq/qyv3oqE+PHVPYVZrMjC31rOxytDlFZvW5nILPIQcLNZ4PhKqa2qpX7PBnKTQSd7Ev9id9yVXlkuxTW9iF3upwWj5w5mrn5vOg3Q9192Ulsgfp1IMSl1p+Z7U9MNtI9Xpl5En6+UHR0dHku2r/8SVXl6Zsz/186xRYcyeTuaPJITkvH+TAKZYLCVqZxg7Q4NTZhsRXiqWgY6+r7VcP/PnMvAhA4vzhsrNkDnn3cHhZhfsDlxKPz/XFigSIzD4bXUZdpXlqnTQtdXLuLB18xLGedew9pGEfp+GicLY79OBnaroaSMe2j/meqM1O26ha+cLhc8w+2hW2ZQu+uAKJD7NFDHajfKdbHOrKM7aXjR7K2cTvtM1ufNos9oFcGmHwwg6tydgwlvk523pMv2vYEQMsKU8d0GaRsR22wWfTOBF7Yz8yxcZY+sEg48bOJp11zzaA1mzWl53YTY9HXnyAyygWZ0q/hDuOYc694enETDfTF92bsUJ387AJeNcHxaIz8m0YSNM2K5wUsyexuwffiQbj5WyueGdLYnSebB6PDGLV52cqcXdZ8dcCBaFLWn6WNL/lOwq4bpftXzg/vHIeO6Mpq+hit56brgR2J+FO3pN0ITpO9N5hGfesx3TXdh5QtlJUsS0zh3nnsTunMq8K3OgbZ41DERG0rm+EW1rmLgmfqDZJ8mt6r+s7Yr13i/ISmX+9BZ6o326BLjUBThej9XApy1P9+ZH33c0jw6Au1+U6XoftbB42XW/TdRET8H6f5fzHPtvnbtrDpbxaaiK4qz9suojvBUG/88h2mY3rdzyG7/E9vxfwfc976CEOPbLB5r3zwXooAv15oTFkobFDAIOZHgkjYMygBp2ZykgQXNYYMozZmQaBaIjKSDUdy2EkXoMzwWGwAUeKKnP2WTGEMYy7rMc5DErkrj6KOTAOoccBIWAAMGG+8Nh85k6cnR5LAMDDXMWSEDDOCzAMRY3xRNUlA0CJD5hjJDPd3JGC0mfzkWI5O89UeG0c7vSYfVGtYGWIRk83gIMgKxq6YrljZalbuRAc8nqt881aLFm6MQMBY6QmBCY0JBGIEhMk8knbSaHBh4U+ZrrIyHsqowiQwTyQJEeLyd6McRYkynJ4iXk2hFASHS6QoCiJF1mzP6rHaiwpaioUpiHZmqHI9jlcmGauQAOnKBXAEiqCzM4WchJMwUg42pZ0DnbbuW3MdkYscwqWu04cHgGERxceDVN85OXRDKCdcXa5PJP5/KhP8ATuQh5ie7/glJlsTo/+TjCQkes2c3Rl1ucNIz+ph4xRRiCx+eysW7jjSUrPYA0HskKqxnjhjgNhOZGIj3NNNvuJbYITmhiaPiRnL3ZEzSQdmfcL+yzNHcOo5EQpZSnIh9hgzNFsAlhnBHCg6Jy0d2JQmJIxAqmx0CbBHJrBWJ+AsyYqrmkqSYADU5NyV4k7nYAJDjKWXFOfdu1zyHqW8CIbgzkUndIU5Y4zllxdZENTwhHQBUWzgCmLylRLBR4w+GCnuPIMDL0hOYPU4LwR2Btj9oQm2R5ZYc8XAWfE7MqPpZmn5h2PK3kfG8SYGDEYGxJkZ0OdCwQZEtaGrGZMjFCzBOCdZ7HHO8f5eXAEiX1WYedkQEUIGENQTWlpiOwYWMEUGlgcYkeTxf5QxVgCccY7umPLfHxwxv3S1/pzGzu5HeM84EAF2UGhxOxwKQaCbBixZgXAhOzQhtJY2wVYwdsz0oXY4w7zH+gKd11gBZIa9XkIHUWF7FA17c7HeXV85ai6zQWQ5pzCYawxfteT8oUfT0+6ybquKB01EcvIPIY6j01f93lwxkPdmEGQKgczhYw8mfKABbzNgCxItiyAyl6TpGiYHItAF2wF9m2HAZw5UYb+uD/WJjNOFslKM4+6whpz2bIPyrjcaxin5sQvvHEOjYm8X1r5wduFmpEciT+Be8CwK12Hc2jOJnBIlu7OcP2zkQDGsVyxw+v6lIUmMZaj2dybhFiLpRJa4VTljiM4NjowVhRbl7qKNeCNcTddjoSFhgMGGYK6VHMGcoGipgNeMQzNMR8ZBcIOFPOTlg7O7gTvFWnWWRozADhyQqaiaVaQqHHIuXyoaIlT+ZzMm1qfU0zMgl1IkMj2hjuFseOsO2fyLoASq02yox0HrA8Ve85Lc2gAGAz7wDvbpyAOLBvGXcg6CxvLHdsIZfU8WyqptHPN2dHfwY6zA6IWq3MtVUpde+T9idL1d9JesQBjx7NKwTGrWnJ/GF3vZAC74lRUJIjBDMR4pBpAut7lzPx9pZgsNf0ZHQkqUhfXVSzPSlS0stKrIhy0smL7XmMwGgFR057ZB67Fs61ep8UyNxlzCeYiWGvaYj0XbW09AMqzW6RP7qF8KpFfIFImbupuUfFUlTRyS0KzT32ef+hybP+h3+/fpJ5KVOwjH116VnrKjXkzu7nQoKANwXSlT5fKWh4og/Gt3A2U0X/gr/JKv4jyurunbyq0nyWJmwZ0rNo469/925ouyhfYlIEsrldAlKbWc0lcDyP6DiR9yIr41oa/gW40Bc9tRPz2DV76jvfduDgEoq697ktURqvlVNHXECyeQ0Ly8qnd/nZjrdeNtdzEPWepeyjrY2y/bT8+cvndRItkCf64K/lbnO2iv98GLsbZAQXrIEvcKC2pZ+pvVJMgN3lLmuZ/Uc2w8lpegQ7v56/YfL9E3T34LvVMNT+O2ndpvyCtHNXt1i26q8F/O77/tTjeIb1HPsmK28/voVpmVeGjsrXLqpo0wd0vOeWo9nyfv3ex6OjjKkDrKo3IZV/Nm49bujT//gpJGaVx2coq8t6meyjXl0704BI/XONsW97NR2lekRter65fwUBpkGdRSmojdyrW2j8k4N3stsiqfF2/T2vVa6Ks74lyFypJgdzkVep6NOvyVOJs+7r92xO65WcB8i8AlVnabDSKKvWT4Npwl6eSoMQnmEJp7Ymi6TQ7UFegfud5/+881I90GSKMrzfGj17q/6/tRWnbc8uwUSJC0ajKqDzK0caNcON68h+/Cxo/U2NEKBIiKkpL4qY+oqajVmOqaPpAGYrr6ej505/8qsAUvSip+iye2m22129x3U7r9tvGLkElaSeIuHTgErd9t0VHwZ9rH4OyREkNUJiVpMa91ZDgYvF6sz03P335+LL7Sn/68iaYr83a3KqouZFV18BTdHhjF/lhRjU1REiUbm8n9LpMkYz69OUb119bF5PaDYV3Cq3G/b/6lEtE6FdTn74x88c47Rs41wLk1QC9njrJKDBRrmAAtI1KgopveXGISHiRabSrsmjjzHfxJRL3UFLfFgpqiwh9naL3Lq4Q9d91wtD3vKZrQn368nsl6OtN5WYlCmr5f1KPv1K/UbsXii6oZku76GmkiNJtk/r1Csjb0ru+xbq+ld5WneCNu/rvSTb/RWPUb9TlkIqEojf/agCNj9qD2zdAiqbdimR/JK6NUI6zE1X3VtQmK6jrZVteeXZbrFl2r3XUcED5qCDRJvJdgloNzy1Rr0PRAUVTv/zyC/Xpy7svB1+pX6lPX962PV/fFMwfuYnRiXLT4Ftf/1e8/qCV/adUvlWtGthvmfuPhebHkldavoL6PXpXBTpGpwuC7wz7BfkPDd+P5k1efLebPx7FL+1YXR0+IHpdXar8jUjjZ0pfjpZ/SkL3FKD0z0+UWRcyFNT3sJ+le1TU9Sgq6/FI0ai6xBbUIUQpdUAUdqvUD1sN3yWXpGi+Qfr2ZPr6Fv26Sn1tUr/++jaEPxDE93Je5TdcqVsXesN3VaDcLRD1vnP+/yVVoCQj6L3aJffLzI8RKVuNH/Rxd2tXE7dn1l/fw/r0+MAw34FJ0z81/icAAP//OpHtlioaAAA=" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 6 -> (known after apply)
        id                      = "lt-08f0a8a5c9c6547df"
      ~ latest_version          = 6 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_stable"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R4aZOjypX2d0Xc/8Ard8RrRw8Si5ZS2XXDQgKtIJGQIPA4FAmkBCJZClJr3/7vE2gpV1f3vbZnJmLi1hcVmec85/Dkk3lOMshSilPKmuccPzPJntAoRwVtJtEJB39mvGyfBqg4v9TViSpLC6gN+8Cp16on1sJFGWXpM8M3uJ9qP9VY9r3RT7UH9jAq86yM6NUWUYr8MMEp/TOziQhOUYJf6lEa0Ya/2db/4WUWKC03uGDl1M+CKN0+M10vou8MrilTfKJNn2T7gPWzdBNtf6qpUYK/S+4P721qtX2Ji/K5xjAsU2XwzGBfYKvBGsMwTFmGa7SnYVZEFxysY3y+2lZ/LFMvy5AtSsT0+/2+JGoXNODPviBXj8O+3pf6/f6grw9Ou40ymZDRZpD2Ip+Mz4ldyFJhQoHMOzQ2RiaP824wWF6O/M7p2Gmok+VKzfGyiLSTtiKjJ99e9JpAyaWAu/SUo3b+HG+2YW+zP2tOqzf5rKLO4mxa0rYdaply2oDVqB2Nqd80dJJ6shLNciNukSjPWrpLJZps+6/b2Oh3hpfwvPU6+7bai07m5NSypd3eULnRSr9ouxxvzpG9/1xOwOdQgIUez/rSfj9xdK/Ykc9KaCVofigOZ3Mh7MsFPaSOtAu95fG86Ar2cofyWdDshSZ6Xcr8UTl3oCKkK7+13B65baR7nTLyFPPS1Ux8ssW23nt6zfWFrTozP9+6BTHQeDxzDTWkl0VXDdxiMVfgKjP4Pu6fW9uQ+lqxkEzitY3DsiteLtyrBBTBHyxaC+6Yt4/H12V4OAop9cTcnC9pgOn0s9Xm9GWap6uzYaRuLlyUo48F3ludOt007JE0nBfudoe7fqany75yavpE7MjG9LyN9ktfOn6O+SdnTxx1BV+RROPjdB6D3TDfmSsBt9Up38mG3XI69ltNux2fN/NDoJZWGLzyg9V4ZFmL/JJtPa7XtpyIAyslT13Q5LG1HTTBZ9s6U2fjPHHFxlr4QT8TRu4mnbYvDoCr6bSnujFKTydR7sJFFMtTrVfCncBxl87gfOYmm8mr6U15qb3pbgIR+aCYt4a+AwNl0uSls2Z3FH7X9d2oP1pMZ5p3WSmcKdLN04nDvP7ywiRolxV/LXAQItrws6T+rd5xILTbfO+q+cFN88QdTnjNlNvV2GQp8TuFtPKOYkrRaWx2jou4s3pKd023i7OlpstNlTvOWk/tGZN5+wBF3wSrHYuI4nV1Ity3ZY5o+Mw0aZLftve6OiPWB1SU18z82ynwzPxyT3RhSHAyH64HC1WdmC9Poo82TxyH20JbaHktvrXpbtrepo0wF4h+jxf8px7fE+7eg4W6XBgyeLh3N20sdoKg13ri29wG+S2PEztix+8EYs/zuh0s4Cc+2HwM3l8PZGC+zA2Ozg1+AGAwNSNpCKwpNKA71TkFguscRwcxPzUgkC1ZG+q2u3I5RTTgVHI5YsGhpquCc9EsaQTjNu8JLocTtW0OYwGMQugJQAo4AGyYzz0+n6KxuzNjBQB4nOlEkQLOfQWWpekxGeumYgGoiAF3ilSunbtKUPp8PtRW7s6zNdEYhTsz5l/1VbC0ZKtjWsDFkJctU1uhkbYwV7kUHPNqrvXNXKysTGsKAs5KbQhsaCkykBUuSNSzsVNCSwwLc8S1sZV3dE6TIEdEoCiuEdODHZMsSLTF4JrzdAChIrtCoEBZka+2dm9YPeuxoumpVNiW4hiWpjqXcG7buQYtkuJUAguoSSo/natJMAFD6eSslEuw284ca7qzYlXQiNp24/AEIDwheLJs+UlUh1OAd9YFCXmmivnJHJMx3IUiJM5hLmhT1Z6c/J1kYSs3He6EVN4XLSs/68eM04YgccTsYq5Iy1O0jsVbLuSlVI/JHI0CaTFWqE9yQ7V7iWODMx5bhjmgFy92ZcOmLVX0C+eizFzL2quJVqpKkA+IxdnD6Rjw7hCQQDMF5eDGoLAVawhSa26Mgxm0g5E5BhdD1pBta0lAAttQcqTFrVbABUeVKMg2J23nEvLeSnpVrf4Mym5py2rLHSnIlPnQVkgETEkzVsBWZW1ipJIIOHJ0UrL3LAK9Ab2A1BK8IThYI/6Mx9kBr8KOLwPBivmlHytTT89bnlCKPrGoNbZiMLIUyE8HphBIKqS8A3nDGluhsZKAd5nGnuieZpf+CSTORYetswU1KeAsSbeVhSXzI7AKJtAi8oC4hir3BjohCogz0TVdRxXjozvqlb7RmznEzZ2Y5IEA9pDvF1rMDxZyIKmWFRurANiQHzhQGRm7gGhke8GmFHvCcfYrvtLDF6wCRY96IoSupkN+oNtO68f76vSmUX2bSyDNBU0gxOD8tqfkcz+enE2bR0hWToZMVGyfQlMktm/6IriQgWlNIUi1o51CTh1PRMAD0eFAFiRbHkDtYChKNEhORWBKjgZ7jssBwR5rA3/UGxnjqaDKdGnYJ1PjrZm6co7aqDwYhKT22C+8UQ6tsXpYrPKjtwsNKzlRfwwPgOOXpgln0J6O4YAu0M5C/sVKAOeukNwSTXPCQ5tai+F05o1DYsRKCVfhRBdOQziyWjDWNMdU2tqqL1qjdroYSnODBBy2JH2h5xwUAk1P+6JmWYZrP3EahC0o52cj7V/QmBw0ZdpaWFMABHrGtmYYqyDR41BAYqgZibv3BVW0jZ6g2YQHu5Bime8MdhrnxFl7xuVtABXeGGcnJw54H2rOTFRm0AIwGPSAd3HOQRysHBi3Ie/OHaK2HCtU9ct0oaXKDtnTk7+DLXcHZCPWZ0aqlabxJPpjre3vlIO2ApwTT/caiXl9pfYG0e1MBrAtT2RNgQRMQUyGugWU21nOzT5WivHCMF+ilOIiRaSqYnlW4qKRld4+IkEjK7YfPfrDIZAN44XnGiLX4J8aPHc3sRdgJoO1YczXM9kx1n2gvaAifUbH8rnEfoFpmaAUbXHxvC9ZjErK8s89Uey2Bb7X7fV6d6tnr8DHa7/KdhWIMbnjG1AyBmCyNCcLba32tf7oXur62vC/H6zce6VfRHnV2bN3F9bPkgSlARvrDsl6j/iOYcrqlTKtr8rrJZCVyeqlpMgjmH2QyB6zIr634O9oG07ASxNTv3mnln1w/QCXB0A2jbf3krXhcjHRzDUE85eQ0rx8bjYPuY9ZzketHr/hxKenHu60UIftUq7rHTpZ49sXb7y9eKNybKAEXbIUHctqnZvv+5Mf5fXdQINmCflx2/K3ONtFf78/IEKyIw7WQZagKC2ZF+ZvTJ1ilLxXVf0/mHq49xrVUn8cvxH4/RTziOAj5oWp/zhrH7F+QRs5rvqxe3Y3wH87v/+1PD4wfcA+zYr7z2+xWmb7wsdlY5ftK2UFj7j0nOMq8mP80ebik0/2AV7v04he36t+j1Hi4hD5uP73N0rKKI3LRranHzHRsVxfW9Ujon64Jtm2fMBHab6nd77eQr+RgdMgz6KUViDf6rXNtTZo4/HtHt8SA5Fnk6KkKbkkjQr9t1X6iL0tsn2+rm65Ff5ty60fW+5hVNICo+TN6rZ+6/Jckmz7xtH9It7wswD7VxbLLK3XasU+9ZPg1raX55LixKeEwWkViWHZNDsyNzZ/4yPBv3PdP7FliAm5nT2/dt//f00vSpseKsNaiSnD4n3G5FGONygitZs8fny7qP2BGWHK0BAzUVpSlPqYmQwbtYlmmH1tIK8nw5dPf/T3BWHYeclUC/bcbPKdXkNotxr33yZBFJe0mWCK2ABR1HxgsVHwpypGvyxxUhEUZiWteG/UFDifv52RL/VPX358bH5lP315l8zXegW3LCoBZftb4ik+vsPFfpgxdQNTGqXb+wq9TTM0Yz59+Sb018YV0riz8MGhUXv8V61yiSn7BvXpG5jfx2rfybmVMq8i6G3VacaAsXYjA+BtVFJcfKuLY0TDq02tuS+LJsl8RK6ZoGPJfFtSmC2m7G2IPSCyx8x/VhuGfWx+thLUpy+/Vcy+3l3uKFFQ2f+Tyv6V+YXZvTJswdQbxtXPoEWUbuvMzzdC3hfx9T3X9b2IN6oNXnu4/5Zl/V8EY35hrotUJAy7+VcTqP2o0bh/SWRYFu1p9nvS2hDnJDszVZfGbLKCuR225U1n98lKZY+CyAz6jI8LGm0iH1HcqHmoxJ0WwwYMy/zlL39hPn358P3hK/Mz8+nL+wbq67uq+mthYnxmUBp8G+v/Stc/6Ij/qZTvVasi9lvl/mOi/mPLmyzfSP2evZsDG+PzlcEPwH5B/4fAj6V5ty++e5vfn8SvPVtVHX4g9Kq67PN3JrU/MOZiuPhjEqJzgNM/PTN2VchwUJ3DfpYecFHVo6isnoeawVQltmCOIU6ZI2YI2qd+2Kj5iF43Rf0d0/eL19f37FdV6mud+fnn9yn8jih+lPN9fueVubeqd36XBc5RgZmP7fX/L5kCJxnFH92ue7/M/BjTslH7lT7ugXaDuF/Y/vqR1uenLsd9RybL/lT7rwAAAP//Frtxy3AaAAA=" -> (known after apply)
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210210154003929600000003" -> (known after apply)
      ~ id                                  = "sfr-8bae3ad7-cdff-463d-988e-2523e1a556c0" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - stable"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a0bd62efe297d67e" -> null
              - version = "6" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a0bd62efe297d67e"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210210154027322200000005" -> (known after apply)
      ~ id                                  = "sfr-f1d45ae7-9d42-4683-a561-7154abfcdfb7" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - stable"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-08f0a8a5c9c6547df" -> null
              - version = "6" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-08f0a8a5c9c6547df"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-2721302523" -> (known after apply)
      ~ instance_id = "i-08d997480fcea25b8" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-3888549415" -> (known after apply)
      ~ instance_id = "i-0487676f48bf9a178" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*